Repository: davidsteeb/z7_semantilizer
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# overview.title
source: Headline structure
de: Überschriften-Struktur

# overview.empty
source: There are no created headlines on this page yet.
de: Auf dieser Seite wurden noch keine Überschriften erstellt.

# overview.description
source: This is a semantic overview of all used headlines on the current page:
de: Dies ist eine semantische Übersicht der verwendeten Überschriften auf der aktuellen Seite:

# overview.showNotifications
source: Activate headline check
de: Headline-Check aktivieren

# overview.hideNotifications
source: Deactivate headline check
de: Headline-Check deaktivieren

# overview.notifications
source: %s hints
de: %s Hinweise

# overview.notification
source: %s hint
de: %s Hinweis

# notification.affectedElements
source: Affected content elements
de: Betroffene Content-Elemente

# notification.1.title
source: No main headline
de: Keine Hauptüberschrift

# notification.1.description
source: There's currently no main headline present. For a correct headline structure a main headline (type 'H1') is needed.
de: Für diese Seite ist aktuell keine Hauptüberschrift vorhanden. Für einen korrekten Aufbau der Überschriften wird eine Hauptüberschrift (Typ: "H1") benötigt.

# notification.2.title
source: Multiple main headlines
de: Mehrere Hauptüberschriften

# notification.2.description
source: It's recommended to only use one main headline (type 'H1') per page.
de: Es wird empfohlen nur eine Hauptüberschrift (Typ: "H1") pro Seite zu verwenden.

# notification.3.title
source: Positioning of main headline
de: Positionierung der Hauptüberschrift

# notification.3.description
source: It's recommended to mark the first headline of a page as the main headline (type 'H1'). Currently it's at the wrong position.
de: Es wird empfohlen die erste Überschrift der Seite als die Hauptüberschrift (Typ: "H1") auszuzeichnen. Aktuell steht diese an falscher Stelle.

# notification.4.title
source: Invalid headline hierarchy
de: Ungültige Überschriften-Hierarchie

# notification.4.description
source: An error in the headline hierarchy has been detected. For a correct semantic distinction of the page, a H1 should be followed by a H2, a H2 should be followed by a H3 and so on.
de: Es wurde ein Fehler in der Hierarchie der Überschriften festgestellt. Für eine korrekte semantische Auszeichnung einer Seite soll auf eine H1 eine H2 folgen, nach einer H2 eine H3 usw.
